validation/rhoFRvol/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       2320;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       2340;
    }
    hotWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       2360;
    }
    coldWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       2420;
    }
    frontBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          2400;
        startFace       2480;
    }
)

// ************************************************************************* //
